{
    "app": {
        "title" : "SDG Indicator 15.4.2 - Mountain Green Cover Index (MGCI)",
        "drawer_item" : {
            "aoi": "Area of Iterest",
            "mountain" : "Mountain descriptor",
            "vegetation" : "Vegetation descriptor",
            "dashboard" : "MGCI results",
            "about" : "About",
            "disclaimer" : "Disclaimer"
        }
    },
    "ui": {
        "title" : "Re-classify custom LC/LU classes",
        "description" : "This module will help you to translate your own land cover / land user (LC/LU) maps into a custom classification. </br></br> In the following input cell you can select the assets stored in your Google Earth Engine account, you can use whether raster (image) or feature collection (table) assets, click over the 'Get attributes' button and a table will show up lettting you select the corresponding class."
    },
    "remap": {
        "label": "Select a LC/LU GEE asset (Feature or Image)",
        "btn" : "Get attributes",
        "code_label" : "Select code column",
        "band_label" : "Select band",
        "error": {
            "error_type" : "\n\nThe input asset must be an instace of one of ee.Image, or  ee.Feature.",
            "no_code_col" : "Please select at least one column name or band."
        }
    },
    "veg_layer" : {
        "title" : "Vegetation descriptor layer",
        "description" : "The vegetation descriptor layer categorizes land cover into green and non-green areas. Green vegetation includes both natural vegetation and vegetation resulting from anthropic activity (e.g. crops, afforestation, etc.). Non-green areas include very sparsely vegetated areas, bare land, water, permanent ice/snow and urban areas.</br></br> This module computes a vegetation descriptor layer using a land use/land cover map as an input. You have the option to use a custom land use/land cover map for your country. If not available, the tool will use a land cover time series produced by the European Space Agency (ESA) under the Climate Change Initiative (CCI) (Available at: http://maps.elie.ucl.ac.be/CCI/viewer/index.php)",
        "instructions":" ",
        "veg_asst":{
            "label": "Select a Land Cover Map",
            "items" : ["Custom Land Cover Map...", "ESA Land Cover Map"]
        },
        "questionaire" : {
            "q1":"Would you like to use a custom land use/land cover map?",
            "q2":"Do you have a reclassification matrix table in a CSV format?"
        }
    },
    "mountain_layer" : {
        "title":"Mountain descriptor layer",
        "description": "SDG Indicator 15.4.2 – Mountain Green Cover Index defines mountains in accordance with the UNEP-WCMC global mountain classification (Kapos et al. 2000). This method classifies mountains according to the following scheme:</br></br><ul><li><b>Class 1</b>: elevation ≥ 4 500 m</li><li><b>Class 2</b>: elevation 3 500–4 500 m</li><li><b>Class 3</b>: elevation 2 500–3 500 m</li><li><b>Class 4</b>: elevation 1 500–2 500 m and slope ≥ 2°</li><li><b>Class 5</b>: elevation 1 000–1 500 m and slope ≥ 5° or LER (Local Elevation Range in the radius of 7 kilometers) > 300 m </li><li><b>Class 6</b>: elevation 300–1 000 m and LER (Local Elevation Range in the radius of 7 kilometers) > 300 m</li></ul></br>This module computes a UNEP-WCMC mountain class map using a Digital Elevation Model (DEM) as an input. You have the option to use a custom DEM for your country. If not available, the tool will use a global UNEP-WCMC mountain classification map produced from [To be defined] at a [To be defined] m resolution.",
        "questionaire":"Would you like to use a custom DEM?",
        "btn" : "Create UNEP-WCMC Mountain Class Map",
        "w_dem" :{
            "label" : "Digital Elevation Model (DEM-DSM)",
            "items" : [
                "Custom DEM...",
                "SRTM 1 arcsec (30m)", 
                "SRTM 3 arcsec (90m)", 
                "Alos World 3D (30m)"
            ]
        }
    },
    "dashboard":{
        "title" : "MGCI results dashboard",
        "description" : "Calculate the Mountain Green Cover Index dashboard, the result will include an overall index for all the Kapos mountain classes and also a more detailed index for each of these classes.",
        "label": {
            "download" : "Export reporting tables",
            "calculate" : "Calculate MGCI",
            "scale" : "Process scale",
            "year": "Year",
            "rsa": "Use real surface area",
            "rsa_name"  :"real surface area",
            "plan" : "planimetric area"
        },
        "alert" : {
            "computing" : "Calculating MGCI values, using {}. This process may take a few minutes.",
            "rendering" : "Rendering dashboard"
        },
        "help":{
            "rsa" : "Use Real Surface Area. Disable it to calculate the results using planimetric area. To more details, please refer to the module documentation.",
            "scale" : "Pixel resolution for the output. It will affect the speed and the accuracy of the results",
            "year": "Select a year for the dashboard outputs. It will be used to label the outputs. If not provided, the reclassified band name will be used."
        },
        "individual" : {
            "title" : "Kapos range {}",
            "desc": {
                    "k1":"Where elevation >= 4,500 meters",
                    "k2":"Where elevation is between 3,500 and 4,500 meters",
                    "k3":"Where elevation is between 2,500 and 3,500 meters",
                    "k4":"Where elevation is between 1,500 and 2,500 meters and the slope is greather than 2%",
                    "k5":"Where elevation is between 1,000 and 1,500 meters and the slope is greather tan 5% or local elevation range (LER 7km radius) is over 300 meters",
                    "k6":"Where elevation is between 300 and 1,000 meters and local elevation range (7km radius) is over 300 meters"
            }
        },
        "global_" : {
            "title" : "Overall Mountain Green Cover Index",
            "desc" : "The last four IPCC classes are considered as green cover in accordance to SDG Indicator 15.4.2 Metadata. All the units are shown in {}."
        }

    }
}