{
    "app": {
        "title" : "SDG Indicator 15.4.2",
        "drawer_item" : {
            "aoi": "1. Area of Interest",
            "vegetation" : "2. Land cover dataset",
            "calculation" : "3. Indicator settings",
            "dashboard" : "4. Results",
            "about" : "About",
            "task" : "Export from task",
            "disclaimer" : "Disclaimer"
        }
    },
    "reclass_view" : {
        "ic_default_label" : "Default Image Collection",
        "ic_custom_label" : "Select a custom Image Collection"
    },
    "aoi" : {
        "view" : {
            "btn" : "Select Area of Interest (AOI)"
        },
        "legend" : {
            "total" : "Total",
            "color" : "Color", 
            "desc" : "Description", 
            "perc" : "%",
            "area" : "Area (sqkm)",
            "no_mountain" : "No mountain area",
            "belts" : "Bioclimatic belts"
        }
    },
    "ui": {
        "title" : "Re-classify custom LC/LU classes",
        "description" : "This module will help you to translate your own land cover / land user (LC/LU) maps into a custom classification. </br></br> In the following input cell you can select the assets stored in your Google Earth Engine account, you can use whether raster (image) or feature collection (table) assets, click over the 'Get attributes' button and a table will show up lettting you select the corresponding class."
    },
    "remap": {
        "label": "Select a LC/LU GEE asset (Feature or Image)",
        "btn" : "Get attributes",
        "code_label" : "Select code column",
        "band_label" : "Select band",
        "error": {
            "error_type" : "\n\nThe input asset must be an instace of one of ee.Image, or  ee.Feature.",
            "no_code_col" : "Please select at least one column name or band."
        }
    },
    "veg_layer" : {
        "title" : "Selection of land cover dataset",
        "description" : "SDG indicator 15.4.2 makes use land cover data to evaluate and monitor land cover change and its estimated impact in terms of ecosystem degradation and recovery.</br>Please indicate below if you wish to use a set of custom land cover maps of your country to compute both indicators. If not, the tool will use the land cover time series produced by the European Space Agency (ESA) under the Climate Change Initiative (CCI) as a default global solution (For further information on this dataset, please check <a href='http://maps.elie.ucl.ac.be/CCI/viewer/index.php' target='_blank'>http://maps.elie.ucl.ac.be/CCI/viewer/index.php</a>)",
        "veg_asst":{
            "label": "Select a Land Cover Map",
            "items" : ["Custom Land Cover Map...", "ESA Land Cover Map"]
        },
        "sub_a_title" : "Sub-indicator 15.4.2a: Mountain Green Cover Index (MGCI)",
        "sub_b_title" : "Sub-indicator 15.4.2b: Proportion of degraded mountain land",
        "subtitle" : "Selection of land cover dataset", 
        "questionnaire" : {
                "q1":"Would you like to use a custom land use/land cover map?",
                "q2":"Would you like to change the default land cover transition matrix?",
                "q3":"Do you need to reclassify your custom land use/cover map to UN-SEEA classification?",
                "sub_a" : "<p><span class='title'>Sub-indicator 15.4.2a</span></p><p>Mountain Green Cover Index (MGCI), measures the extent and changes of green cover in mountain areas. In this sub-indicator, land cover is used to categorize land into green and non-green cover areas. Green cover includes areas covered by both natural vegetation and vegetation resulting from anthropic activity, whereas non-green areas include non-vegetated areas such as bare land, water, permanent ice/snow, urban areas and sparsely vegetated areas.</p>",
                "sub_b" : "<p><span class='title'>Sub-indicator 15.4.2b</span></p><p>Proportion of degraded mountain land, monitors the extent of degraded mountain land as a result of land cover change. In this sub-indicator, land cover is used to identify areas where changes in the type of land cover (land cover transitions) may indicate a decline or loss of biodiversity, mountain ecosystem functions or services that are considered desirable in a local or national context.</p>",
                "alert_not_classify" : "You have chose not to reclassify a custom land cover map. The module will assume that the selected land cover map is already classified according to the UN-SEEA classification and it will use the default transition matrix.",
                "btn" : {
                    "label" : "Validate settings"
                }
        },
        "stepper" : {
            "header" : {
                "data_selection" : "Dataset selection",
                "reclassify_a" : "Reclassify Land Cover for Subindicator A",
                "reclassify_b" : "Reclassify Land Cover for Subindicator B",
                "transition_matrix" : "Transition matrix"
            }
        }
    },
    "reclass" : {
        "title" : "Reclassify table",
        "get_classes" : "Get classes",
        "no_data" : "No data",
        "non_complete" : "You have classified {} classes. Empty classes will be masked out from the analysis.",
        "description" : "Please reclassify the land cover classes of your custom land cover datasets to the reference land cover legend used for this indicator",
        "tooltip": {
            "save_matrix" : "Save matrix as .csv file",
            "load_matrix" : "Load matrix from .csv file",
            "load_target" : {
                "btn" : "Import target land cover classes",
                "title" : "Target land cover classes",
                "load_btn" : "Load target classes",
                "cancel_btn" : "Cancel"
            },
            "info" : "Show info"
        },
        "default_table" : {
            "header" : {
                "lc_class" : "Land cover class",
                "desc" : "Name",
                "color" : "Color"
            }
        },
        "dialog" : {
            "save" : {
                "btn_label" : "Save",
                "title" : "Save matrix",
                "w_file_label" : "Set a matrix file name:",
                "alert" : {
                    "default" : "Choose a name for the output file",
                    "active" : "Your file will be saved on: {} </br> as {}."
                },
                "error" : {
                    "no_matrix" : "There is no table to save, please fill up the table first.",
                    "no_name" : "Please insert a name for the file."
                }
            },
            "target" : {
                "btn_label" : "Load",
                "description" : "This module allows users to modify the default target land cover classes used in the reclassification process. The module is set to use the standard 10 SEEA classes by default, but for sub indicator B, users have the option to either use these default classes or create their own custom classification. To use the custom classification option, simply select the 'custom' button and upload a file containing the target classifications that will be used in the reclassification table."
            },
            "import_" : {
                "title" : "Load remapping table",
                "btn_label" : "Load",
                "error" : {
                    "no_file" : "Please select a file containing a reclassified matrix.",
                    "no_table" : "Please go to the step 1 and get the classes table first.",
                    "no_valid" : "The file you have selected is not valid. Please select a valid file."
                }
            }
        }
    },
    "calculation" : {
        "sub_a" : {
            "title" : "Sub indicator A",
            "desc_active" : "Based on the data you've provided, the module can generate reports for the following years. Please note that if a year is missing, the module will employ linear interpolation to estimate the values for that year.",
            "desc_disabled" : "The subindicator A will not be calculated. To activate its processing, click the top right switch in this card and select the target layer(s).",
            "desc_no_data" : "You have activated the subindicator A, use the 'Add layer' button to select the target layer(s)."
        },
        "sub_b" : {
            "title" : "Sub indicator B",
            "desc_active" : "Based on the data you've provided, the module can generate reports for the following years.",
            "desc_disabled" : "The subindicator B will not be calculated. To activate its processing, click the top right switch in this card and select the target layer(s).",
            "desc_no_data" : "You have activated the subindicator A, use the 'Add layer' button to select the target layer(s)."

        },
        "year" : "Year",
        "baseline_title" : "Baseline period",
        "reporting_title" : "Reporting years",
        "reporting_subtitle" : "Each year will be reported against the baseline",
        "y_base" : "Baseline period (year)",
        "y_start" : "Initial year",
        "y_end" : "Final year",
        "y_report" : "Reporting period (year)",
        "y_actual" : "Actual year",
        "error" : {
            "no_subind" : "You have to select at least one indicator.",
            "no_years" : "You have to select at least one layer (year)."
        },
        "match_year" : "Corresponding year"
    },
    "dashboard":{
        "title" : "SDG Indicator 15.4.2 Calculation",
        "description" : "To calculate the SDG Indicator 15.4.2 you will have to provide the inputs for each of the subindicators.",
        "report" : {
            "title":"Download report",
            "description": "The module will use the data that has been calculated to produce the following table.<ul><li></li></ul>"
        },
        "advanced_options" : "Advanced options",
        "tasks" : {
            "title":"Process on the GEE background tasks",
            "description" : "This section is designed to help you with calculations that are running in the background on Google Earth Engine. Here is what you can do:<br><br>- **Locate Your Task File**: A unique 'task file' is created for each calculation that was sent to the GEE background, which you can find at '<i>{}</i>' folder.<br>- **Monitor Your Task**: Keep an eye on your task's progress and check its current status at any time.<br>- **Download Results**: Once completed, you can download the results and reporting tables directly from here.<br>- **View Your Dashboard**: Your results will automatically populate the dashboard, making it easy to review and analyze the data.<br>Just follow the steps provided on this page to smoothly manage and retrieve your calculation outputs."
        },
        "label": {
            "download" : "Export reporting tables",
            "calculate" : "Calculate indicator",
            "calculate_from_task" : "Download & Export tables",
            "scale" : "Process scale",
            "year": "Year",
            "rsa": "Use real surface area",
            "rsa_name"  :"real surface area",
            "plan" : "planimetric area",
            "source" : "Institution",
            "background" : "Run in EE background (for large datasets)"
        },
        "alert" : {
            "computing" : "Calculating MGCI values, using {}. This process could take a few minutes.",
            "rendering" : "Rendering dashboard",
            "tasks_failed": "Due to computation timed out in GEE, the statistics couldn't be completed on the fly. However, the process has been sent to GEE under the name '{}'. You can track its progress in <a href='https://code.earthengine.google.com/tasks'>tasks tracker</a>. Once it is completed, you will be able to use use the {} file in the 'Calculation from task' tab to generate the report.",
            "tasks_rsa": "The calculation is being executed in GEE under the name '{}', you can track its progress in <a href='https://code.earthengine.google.com/tasks'>tasks tracker</a>. Once the process is complete, you will be able to use use the {} file in the 'Calculation from task' tab to generate the report. ",
            "no_summary" : "It seems like you have not calculated the MGCI. Please calculate it before trying to export the results."
        },
        "help":{
            "rsa" : "Use Real Surface Area. Disable it to calculate the results using planimetric area. To more details, please refer to the module documentation.",
            "year": "Select a year for the dashboard outputs. It will be used to label the outputs. If not provided, the reclassified band name will be used.",
            "source": "Please insert the name of the institution you belong to.",
            "background" : "Run the process in the background. Use this option when there are computation time errors or when the tool doesn't show promptly results.",
            "scale" : "If activated, the process will be executed at the selected scale. It will affect the speed and the accuracy of the results. Otherwise, the process will be executed at the original scale of the input data."
        },
        "global_" : {
            "title" : "Overall Mountain Green Cover Index",
            "desc" : "The last four SEEA land cover classes in the bar chart plot are considered as green cover in accordance to SDG Indicator 15.4.2 Metadata. All units are shown in {}."
        },
        "individual" : {
            "title" : "Bioclimatic belt {}",
            "desc" : {
                "belt_1":"Mountain areas where the growing season mean temperature is below < 3.5 °C and the growing season length is less than 10 days",
                "belt_2":"Mountain areas where the growing season mean temperature is between 3.5 °C and 6.4 °C and the growing season length is between 10 and 54 days.",
                "belt_3":"Mountain areas where the growing season mean temperature is between 6.4 °C and 15 °C’",
                "belt_4":"Mountain areas where the growing season mean temperature is above 15 °C’"
            }
        }
    },
    "error" : {
        "no_aoi" : "Please select an area of interest first."
    }
}