{
    "app": {
        "title" : "SDG Indicator 15.4.2 - Mountain Green Cover Index (MGCI) (BETA)",
        "drawer_item" : {
            "aoi": "Area of Iterest",
            "vegetation" : "Land cover dataset",
            "settings" : "Indicator settings",
            "dashboard" : "MGCI results",
            "about" : "About",
            "disclaimer" : "Disclaimer"
        }
    },
    "reclass_view" : {
        "ic_default_label" : "Default Image Collection",
        "ic_custom_label" : "Select a custom Image Collection"
    },
    "aoi" : {
        "view" : {
            "btn" : "Select Area of Interest (AOI)"
        },
        "legend" : {
            "total" : "Total",
            "color" : "Color", 
            "desc" : "Description", 
            "perc" : "%",
            "area" : "Area (sqkm)",
            "no_mountain" : "No mountain area",
            "belts" : "Bioclimatic belts"
        }
    },
    "ui": {
        "title" : "Re-classify custom LC/LU classes",
        "description" : "This module will help you to translate your own land cover / land user (LC/LU) maps into a custom classification. </br></br> In the following input cell you can select the assets stored in your Google Earth Engine account, you can use whether raster (image) or feature collection (table) assets, click over the 'Get attributes' button and a table will show up lettting you select the corresponding class."
    },
    "remap": {
        "label": "Select a LC/LU GEE asset (Feature or Image)",
        "btn" : "Get attributes",
        "code_label" : "Select code column",
        "band_label" : "Select band",
        "error": {
            "error_type" : "\n\nThe input asset must be an instace of one of ee.Image, or  ee.Feature.",
            "no_code_col" : "Please select at least one column name or band."
        }
    },
    "veg_layer" : {
        "title" : "Selection of land cover dataset",
        "description" : "SDG indicator 15.4.2 makes use land cover data to evaluate and monitor land cover change and its estimated impact in terms of ecosystem degradation and recovery.</br>Please indicate below if you wish to use a set of custom land cover maps of your country to compute both indicators. If not, the tool will use the land cover time series produced by the European Space Agency (ESA) under the Climate Change Initiative (CCI) as a default global solution (For further information on this dataset, please check <a href='http://maps.elie.ucl.ac.be/CCI/viewer/index.php' target='_blank'>http://maps.elie.ucl.ac.be/CCI/viewer/index.php</a>)",
        "veg_asst":{
            "label": "Select a Land Cover Map",
            "items" : ["Custom Land Cover Map...", "ESA Land Cover Map"]
        },
        "sub_a_title" : "Sub-indicator 15.4.2a: Mountain Green Cover Index (MGCI)",
        "sub_b_title" : "Sub-indicator 15.4.2b: Proportion of degraded mountain land",
        "subtitle" : "Settings", 
        "questionaire" : {
                "q1":"Would you like to use a custom land use/land cover map?",
                "q2":"Would you like to change the default land cover transition matrix?",
                "sub_a" : "<p><span class='title'>Sub-indicator 15.4.2a</span></p><p>Mountain Green Cover Index (MGCI), measures the extent and changes of green cover in mountain areas. In this sub-indicator, land cover is used to categorize land into green and non-green cover areas. Green cover includes areas covered by both natural vegetation and vegetation resulting from anthropic activity, whereas non-green areas include non-vegetated areas such as bare land, water, permanent ice/snow, urban areas and sparsely vegetated areas.</p>",
                "sub_b" : "<p><span class='title'>Sub-indicator 15.4.2b</span></p><p>Proportion of degraded mountain land, monitors the extent of degraded mountain land as a result of land cover change. In this sub-indicator, land cover is used to identify areas where changes in the type of land cover (land cover transitions) may indicate a decline or loss of biodiversity, mountain ecosystem functions or services that are considered desirable in a local or national context.</p>",
                "btn" : {
                    "label" : "Open parameter settings"
                }
        },
        "tabs" : {
            "lc_classification" : "Land cover classification",
            "transition_matrix" : "Transition matrix"
        }
    },
    "reclass" : {
        "title" : "Reclassify table",
        "get_classes" : "Get classes",
        "no_data" : "No data",
        "non_complete" : "You have classified {} classes. Empty classes will be classified as zero (0).",
        "tooltip": {
            "save_matrix" : "Save matrix as .csv file",
            "load_matrix" : "Load matrix from .csv file",
            "load_target" : {
                "btn" : "Import target land cover classes",
                "title" : "Target land cover classes",
                "load_btn" : "Load target classes",
                "cancel_btn" : "Cancel"
            }
        },
        "target_dialog" : {
            "description" : "This module allows users to modify the default target land cover classes used in the reclassification process. The module is set to use the standard 10 IPCC classes by default, but for sub indicator B, users have the option to either use these default classes or create their own custom classification. To use the custom classification option, simply select the 'custom' button and upload a file containing the target classifications that will be used in the reclassification table."
        }
    },
    "calculation" : {
        "sub_a" : {
            "title" : "Sub indicator A",
            "desc_active" : "Based on the data you've provided, the module can generate reports for the following years. Please note that if a year is missing, the module will employ linear interpolation to estimate the values for that year.",
            "desc_disabled" : "The subindicator A will not be calculated. To activate its processing, click the top right switch in this card and select the target layer(s).",
            "desc_no_data" : "You have activated the subindicator A, use the 'Add layer' button to select the target layer(s)."
        },
        "sub_b" : {
            "title" : "Sub indicator B",
            "desc_active" : "Based on the data you've provided, the module can generate reports for the following years. Please note that if a year is missing, the module will employ linear interpolation to estimate the values for that year.",
            "desc_disabled" : "The subindicator B will not be calculated. To activate its processing, click the top right switch in this card and select the target layer(s).",
            "desc_no_data" : "You have activated the subindicator A, use the 'Add layer' button to select the target layer(s)."
        },
        "y_base" : "Baseline period (year)",
        "y_report" : "Reporting period (year)",
        "y_actual" : "Actual year",
        "error" : {
            "no_subind" : "You have to select at least one indicator.",
            "no_years" : "You have to select at least one layer (year)."
        },
        "match_year" : "Corresponding year"
    },
    "dashboard":{
        "title" : "SDG Indicator 15.4.2 Calculation",
        "description" : "Calculate the Mountain Green Cover Index dashboard, the result will include an overall index for all the Kapos mountain classes and also a more detailed index for each of these classes.",
        "report" : {
            "title":"Download report",
            "description": "The module will use the data that has been calculated to produce the following tables.<ul><li>Table1_MountainArea</li><li>Table2_1542a_LandCoverType</li><li>Table3_1542a_MGCI</li><li>Table4_1542b_pdma_area</li><li>Table5_1542b_pdma_pt</li></ul>"
        },
        "tasks" : {
            "title":"Calculation on background",
            "description":"This tab will help you to download the results file required to get the dashboard with the MGCI. You can track the progress of your task in the <a href='https://code.earthengine.google.com/tasks'>GEE tasks tracker</a>, and once it is done, you can select whether the task id given in the calculation tab or use the tasks file which is stored in the '<i>{}</i>' folder."
        },
        "label": {
            "download" : "Export reporting tables",
            "calculate" : "Calculate MGCI",
            "scale" : "Process scale",
            "year": "Year",
            "rsa": "Use real surface area",
            "rsa_name"  :"real surface area",
            "plan" : "planimetric area",
            "source" : "Institution"
        },
        "alert" : {
            "computing" : "Calculating MGCI values, using {}. This process could take a few minutes.",
            "rendering" : "Rendering dashboard",
            "tasks_failed": "Due to computation timed out in GEE, the statistics couldn't be completed on the fly. However, the process has been sent to GEE under the name '{}'. You can track its progress in <a href='https://code.earthengine.google.com/tasks'>tasks tracker</a>. Once it is completed, you will be able to use use the {} file in the 'Calculation from task' tab to generate the report.",
            "tasks_rsa": "The calculation is being executed in GEE under the name '{}', you can track its progress in <a href='https://code.earthengine.google.com/tasks'>tasks tracker</a>. Once the process is complete, you will be able to use use the {} file in the 'Calculation from task' tab to generate the report. ",
            "no_summary" : "It seems like you have not calculated the MGCI. Please calculate it before trying to export the results."
        },
        "help":{
            "rsa" : "Use Real Surface Area. Disable it to calculate the results using planimetric area. To more details, please refer to the module documentation.",
            "scale" : "Pixel resolution for the output. It will affect the speed and the accuracy of the results",
            "year": "Select a year for the dashboard outputs. It will be used to label the outputs. If not provided, the reclassified band name will be used.",
            "source": "Please insert the name of the institution you belong to."
        },
        "global_" : {
            "title" : "Overall Mountain Green Cover Index",
            "desc" : "The last four IPCC classes are considered as green cover in accordance to SDG Indicator 15.4.2 Metadata. All the units are shown in {}."
        },
        "individual" : {
            "title" : "Bioclimatic belt {}",
            "desc" : {
                "belt_1":"Where elevation >= 4,500 meters",
                "belt_2":"Where elevation is between 3,500 and 4,500 meters",
                "belt_3":"Where elevation is between 2,500 and 3,500 meters",
                "belt_4":"Where elevation is between 1,500 and 2,500 meters and the slope is greather than 2%"
            }
        }
    }
}